N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/bluetooth/application/common/ApplMain.c
    if( PWR_CheckIfDeviceCanGoToSleep() && (xExpectedIdleTime > mAppOverheadTicks_c))
    {
        /* Set deep-sleep duration. Compensate for the application processing overhead time */
        PWR_SetDeepSleepTimeInMs((xExpectedIdleTime - mAppOverheadTicks_c) * portTICK_PERIOD_MS);
        PWR_ResetTotalSleepDuration();
        
        /* Enter Low Power */
        OSA_InterruptDisable();   
        if(eAbortSleep !=  eTaskConfirmSleepModeStatus())
        {
            wakeupReason = PWR_EnterLowPower();
            /* Get actual deep sleep time and convert it to OS ticks */
            xExpectedIdleTime = PWR_GetTotalSleepDurationMS() / portTICK_PERIOD_MS;
            /* Update the OS time ticks. */
            vTaskStepTick( xExpectedIdleTime );
        }
        else
        {
            wakeupReason.AllBits = 0U;
        }
        OSA_InterruptEnable();  
        (void)wakeupReason;
/* On KW37, KW38, KW39 series, key handle is processed directly in the lowpower FWK module */
#if (!defined(KW37A4_SERIES) && !defined(KW37Z4_SERIES) && !defined(KW38A4_SERIES) && !defined(KW38Z4_SERIES) && !defined(KW39A4_SERIES))
#if gKBD_KeysCount_c > 0
        /* Woke up on Keyboard Press */
        if(wakeupReason.Bits.FromKeyBoard != 0U)
        {
#if defined(cPWR_EnableDeepSleepMode_8) && (cPWR_EnableDeepSleepMode_8)
            /* Skip over the key scan timer to improve low power consumption. */
            BleApp_HandleKeys(gKBD_EventPressPB1_c);
#else
            KBD_SwitchPressedOnWakeUp();
#endif
        }
#endif /* gKBD_KeysCount_c > 0 */
#endif /* (!defined(KW37A4_SERIES) && !defined(KW37Z4_SERIES) && !defined(KW38A4_SERIES) && !defined(KW38Z4_SERIES) && !defined(KW39A4_SERIES)) */
        
    }
    else
    {
        /* Enter MCU Sleep */
        PWR_EnterSleep();
    }
}
#endif /* defined(cPWR_UsePowerDownMode) && (cPWR_UsePowerDownMode) && (configUSE_TICKLESS_IDLE != 0) */
#endif /* FSL_RTOS_FREE_RTOS */